app/controllers/builds_controller.rb

SELECT "builds".* FROM "builds" INNER JOIN "commits" ON "builds".commit_id = "commits".id WHERE (("commits".project_id = 1)) ORDER BY created_at DESC LIMIT 1
---
  def index
    @latest = @project.builds.first