app/controllers/projects_controller.rb

  def index
    respond_to do |format|
      format.html do
        @projects = Project.all(:include => [{ :builds => :commit }, :commits])
---
SELECT * FROM "projects"